### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["0"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-central1-a/firewallEndpoints/fwe-dev-core-us-central1-a"
      + id                = (known after apply)
      + location          = "us-central1-a"
      + name              = "assoc-dev-us-central1-a"
      + network           = "projects/chspoc-dev-host-app1/global/networks/vpc-dev-app1-01"
      + parent            = "projects/chspoc-dev-host-app1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["1"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-central1-b/firewallEndpoints/fwe-dev-core-us-central1-b"
      + id                = (known after apply)
      + location          = "us-central1-b"
      + name              = "assoc-dev-us-central1-b"
      + network           = "projects/chspoc-dev-host-app1/global/networks/vpc-dev-app1-01"
      + parent            = "projects/chspoc-dev-host-app1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["10"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-east4-a/firewallEndpoints/fwe-dev-core-us-east4-a"
      + id                = (known after apply)
      + location          = "us-east4-a"
      + name              = "assoc-dev-us-east4-a"
      + network           = "projects/chspoc-dev-host-svc1/global/networks/vpc-dev-svc1-01"
      + parent            = "projects/chspoc-dev-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["11"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-east4-b/firewallEndpoints/fwe-dev-core-us-east4-b"
      + id                = (known after apply)
      + location          = "us-east4-b"
      + name              = "assoc-dev-us-east4-b"
      + network           = "projects/chspoc-dev-host-svc1/global/networks/vpc-dev-svc1-01"
      + parent            = "projects/chspoc-dev-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["12"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-central1-a/firewallEndpoints/fwe-dev-core-us-central1-a"
      + id                = (known after apply)
      + location          = "us-central1-a"
      + name              = "assoc-dev-us-central1-a"
      + network           = "projects/chspoc-dev-host-svc1/global/networks/vpc-dev-svc1-02"
      + parent            = "projects/chspoc-dev-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["13"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-central1-b/firewallEndpoints/fwe-dev-core-us-central1-b"
      + id                = (known after apply)
      + location          = "us-central1-b"
      + name              = "assoc-dev-us-central1-b"
      + network           = "projects/chspoc-dev-host-svc1/global/networks/vpc-dev-svc1-02"
      + parent            = "projects/chspoc-dev-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["14"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-east4-a/firewallEndpoints/fwe-dev-core-us-east4-a"
      + id                = (known after apply)
      + location          = "us-east4-a"
      + name              = "assoc-dev-us-east4-a"
      + network           = "projects/chspoc-dev-host-svc1/global/networks/vpc-dev-svc1-02"
      + parent            = "projects/chspoc-dev-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["15"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-east4-b/firewallEndpoints/fwe-dev-core-us-east4-b"
      + id                = (known after apply)
      + location          = "us-east4-b"
      + name              = "assoc-dev-us-east4-b"
      + network           = "projects/chspoc-dev-host-svc1/global/networks/vpc-dev-svc1-02"
      + parent            = "projects/chspoc-dev-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["2"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-east4-a/firewallEndpoints/fwe-dev-core-us-east4-a"
      + id                = (known after apply)
      + location          = "us-east4-a"
      + name              = "assoc-dev-us-east4-a"
      + network           = "projects/chspoc-dev-host-app1/global/networks/vpc-dev-app1-01"
      + parent            = "projects/chspoc-dev-host-app1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["3"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-east4-b/firewallEndpoints/fwe-dev-core-us-east4-b"
      + id                = (known after apply)
      + location          = "us-east4-b"
      + name              = "assoc-dev-us-east4-b"
      + network           = "projects/chspoc-dev-host-app1/global/networks/vpc-dev-app1-01"
      + parent            = "projects/chspoc-dev-host-app1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["4"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-central1-a/firewallEndpoints/fwe-dev-core-us-central1-a"
      + id                = (known after apply)
      + location          = "us-central1-a"
      + name              = "assoc-dev-us-central1-a"
      + network           = "projects/chspoc-dev-host-app1/global/networks/vpc-dev-app1-02"
      + parent            = "projects/chspoc-dev-host-app1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["5"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-central1-b/firewallEndpoints/fwe-dev-core-us-central1-b"
      + id                = (known after apply)
      + location          = "us-central1-b"
      + name              = "assoc-dev-us-central1-b"
      + network           = "projects/chspoc-dev-host-app1/global/networks/vpc-dev-app1-02"
      + parent            = "projects/chspoc-dev-host-app1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["6"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-east4-a/firewallEndpoints/fwe-dev-core-us-east4-a"
      + id                = (known after apply)
      + location          = "us-east4-a"
      + name              = "assoc-dev-us-east4-a"
      + network           = "projects/chspoc-dev-host-app1/global/networks/vpc-dev-app1-02"
      + parent            = "projects/chspoc-dev-host-app1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["7"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-east4-b/firewallEndpoints/fwe-dev-core-us-east4-b"
      + id                = (known after apply)
      + location          = "us-east4-b"
      + name              = "assoc-dev-us-east4-b"
      + network           = "projects/chspoc-dev-host-app1/global/networks/vpc-dev-app1-02"
      + parent            = "projects/chspoc-dev-host-app1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["8"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-central1-a/firewallEndpoints/fwe-dev-core-us-central1-a"
      + id                = (known after apply)
      + location          = "us-central1-a"
      + name              = "assoc-dev-us-central1-a"
      + network           = "projects/chspoc-dev-host-svc1/global/networks/vpc-dev-svc1-01"
      + parent            = "projects/chspoc-dev-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # google_network_security_firewall_endpoint_association.fw_assoc_dev["9"] will be created
  + resource "google_network_security_firewall_endpoint_association" "fw_assoc_dev" {
      + create_time       = (known after apply)
      + disabled          = false
      + effective_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + firewall_endpoint = "organizations/872410903863/locations/us-central1-b/firewallEndpoints/fwe-dev-core-us-central1-b"
      + id                = (known after apply)
      + location          = "us-central1-b"
      + name              = "assoc-dev-us-central1-b"
      + network           = "projects/chspoc-dev-host-svc1/global/networks/vpc-dev-svc1-01"
      + parent            = "projects/chspoc-dev-host-svc1"
      + reconciling       = (known after apply)
      + self_link         = (known after apply)
      + state             = (known after apply)
      + terraform_labels  = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time       = (known after apply)
    }

  # module.firewall-policy.google_compute_firewall_policy.hierarchical[0] will be created
  + resource "google_compute_firewall_policy" "hierarchical" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + parent             = "chspoc-dev-core"
      + rule_tuple_count   = (known after apply)
      + self_link          = (known after apply)
      + self_link_with_id  = (known after apply)
      + short_name         = "fw-dev-app-svc-policy"
    }

  # module.firewall-policy.google_compute_firewall_policy_rule.hierarchical["ingress/in-inspect-app-svc"] will be created
  + resource "google_compute_firewall_policy_rule" "hierarchical" {
      + action                 = "apply_security_profile_group"
      + creation_timestamp     = (known after apply)
      + description            = "Inspect App project - Svc project"
      + direction              = "INGRESS"
      + disabled               = false
      + firewall_policy        = (known after apply)
      + id                     = (known after apply)
      + kind                   = (known after apply)
      + priority               = 4201
      + rule_tuple_count       = (known after apply)
      + security_profile_group = "//networksecurity.googleapis.com/organizations/872410903863/locations/global/securityProfileGroups/nspg-threatprevention-group"

      + match {
          + dest_ip_ranges = [
              + "10.3.12.0/24",
            ]
          + src_ip_ranges  = [
              + "10.3.22.0/24",
            ]

          + layer4_configs {
              + ip_protocol = "tcp"
              + ports       = []
            }
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "billing" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "universe" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `skipped`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*